In [8]:
import pandas as pd
pd.read_csv(r"D:\University\6th SEMESTER\example.csv", na_values = "Not Found")

    Name  Age      City
0  Alice   30  New York
1    Bob   25       NaN

In [105]:
pd.read_csv(r'D:\University\6th SEMESTER\example.csv' , na_values = ["Not Found", "No Values"])

    Name  Age      City
0  Alice   30  New York
1    Bob   25       NaN

In [109]:
pd.read_csv(r"D:\University\6th SEMESTER\example.csv" , na_values = {'Age': "no value"})

    Name  Age      City
0  Alice   30  New York
1    Bob   25       NaN

In [111]:
pd.read_csv(r"D:\University\6th SEMESTER\example.csv" , keep_default_na = 'False')

    Name  Age      City
0  Alice   30  New York
1    Bob   25       NaN

In [113]:
df  = pd.read_csv(r"D:\University\6th SEMESTER\example.csv") 
df.isnull()

    Name    Age   City
0  False  False  False
1  False  False   True

In [115]:

df  = pd.read_csv(r"D:\University\6th SEMESTER\example.csv") 
df.isnull().sum()

Name    0
Age     0
City    1
dtype: int64

In [117]:
#total of all colums
df  = pd.read_csv(r"D:\University\6th SEMESTER\example.csv") 
df.isnull().sum().sum()

1

In [119]:
df  = pd.read_csv(r"D:\University\6th SEMESTER\example.csv") 
df.notnull()

   Name   Age   City
0  True  True   True
1  True  True  False

In [121]:
df  = pd.read_csv(r"D:\University\6th SEMESTER\example.csv") 
df.notnull().sum()

Name    2
Age     2
City    1
dtype: int64

In [123]:
df  = pd.read_csv(r"D:\University\6th SEMESTER\example.csv") 
df.notnull().sum().sum()

5

In [10]:
# Creating a DataFrame with missing values
data = {
    "Name": ["Alice", "Bob", "Charlie", None, "Eve"],
    "Age": [25, None, 30, 22, None],
    "City": ["New York", "Los Angeles", None, "Chicago", "Houston"],
    "Salary": [50000, 60000, None, None, 75000]
}

doc = pd.DataFrame(data)

print("Original DataFrame:")
print(doc)

Original DataFrame:
      Name   Age         City   Salary
0    Alice  25.0     New York  50000.0
1      Bob   NaN  Los Angeles  60000.0
2  Charlie  30.0         None      NaN
3     None  22.0      Chicago      NaN
4      Eve   NaN      Houston  75000.0

In [12]:
doc.notnull()

    Name    Age   City  Salary
0   True   True   True    True
1   True  False   True    True
2   True   True  False   False
3  False   True   True   False
4   True  False   True    True

In [14]:
doc.notnull().sum()

Name      4
Age       3
City      4
Salary    3
dtype: int64

In [16]:
doc.notnull().sum().sum()

14

In [18]:
doc.isnull()

    Name    Age   City  Salary
0  False  False  False   False
1  False   True  False   False
2  False  False   True    True
3   True  False  False    True
4  False   True  False   False

In [20]:
doc.isnull().sum()

Name      1
Age       2
City      1
Salary    2
dtype: int64

In [22]:
doc.isnull().sum().sum()

6

In [24]:
doc.dropna()

    Name   Age      City   Salary
0  Alice  25.0  New York  50000.0

In [26]:
doc.dropna(axis=0)

    Name   Age      City   Salary
0  Alice  25.0  New York  50000.0

In [28]:
doc.dropna(axis = 1 ,how = 'any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [30]:
doc.dropna(how = 'all')

      Name   Age         City   Salary
0    Alice  25.0     New York  50000.0
1      Bob   NaN  Los Angeles  60000.0
2  Charlie  30.0         None      NaN
3     None  22.0      Chicago      NaN
4      Eve   NaN      Houston  75000.0

In [32]:
doc.dropna(thresh = 1)# non null values

      Name   Age         City   Salary
0    Alice  25.0     New York  50000.0
1      Bob   NaN  Los Angeles  60000.0
2  Charlie  30.0         None      NaN
3     None  22.0      Chicago      NaN
4      Eve   NaN      Houston  75000.0

In [44]:
doc.dropna(inplace = False)

    Name   Age      City   Salary
0  Alice  25.0  New York  50000.0